## Plan changes
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
variables.tf
```



**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 7 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forms_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_secrets_manager"  {
      ~ id      = "3501845100" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (4 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "d860f4b473912678133a3f101afb77ca7e1e46354703ef71fa47611222b106ac" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                    ]
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          + "ircc_config"              = "eyJmb3JtcyI6WzgxLDgzXSwicHJvZ3JhbUZpZWxkSUQiOjIsImxhbmd1YWdlRmllbGRJRCI6NCwiY29udGFjdEZpZWxkSUQiOjMsImxpc3RNYXBwaW5nIjp7IkVuZ2xpc2giOnsiSW1taWdyYXRpb24gcHJvZ3JhbSBmb3IgQWZnaGFucyB3aG8gYXNzaXN0ZWQgdGhlIEdvdmVybm1lbnQgb2YgQ2FuYWRhIGFuZCB0aGVpciBlbGlnaWJsZSBmYW1pbHkgbWVtYmVycy4iOnsicGhvbmUiOiJiYWNjYmE4Mi02MDg3LTQ2OTctOGU5MS1lZmUwNmU3MzU3MmUiLCJlbWFpbCI6ImJhZTFjYjU4LTg3OTItNDQ5Mi1iMzVjLWIxNTk1YTE2MWFlMiJ9LCJIdW1hbml0YXJpYW4gcHJvZ3JhbSB0byBoZWxwIEFmZ2hhbiBuYXRpb25hbHMgcmVzZXR0bGUgdG8gQ2FuYWRhLiI6eyJwaG9uZSI6IjI4ZmVjMjgzLWIyNWItNDdjMS05OWVlLWU0OGMyMDhlZmEyMyIsImVtYWlsIjoiYWIyNmE2YjUtNTdhYS00Y2MyLTg1ZmUtMzA1M2VkMzQ0ZmU4In19LCJBbmdsYWlzIjp7IlByb2dyYW1tZSBk4oCZaW1taWdyYXRpb24gcG91ciBsZXMgQWZnaGFucyBxdWkgb250IGFpZMOpIGxlIGdvdXZlcm5lbWVudCBkdSBDYW5hZGEgZXQgbGVzIG1lbWJyZXMgYWRtaXNzaWJsZXMgZGUgbGV1cnMgZmFtaWxsZXMuIjp7InBob25lIjoiYmFjY2JhODItNjA4Ny00Njk3LThlOTEtZWZlMDZlNzM1NzJlIiwiZW1haWwiOiJiYWUxY2I1OC04NzkyLTQ0OTItYjM1Yy1iMTU5NWExNjFhZTIifSwiUHJvZ3JhbW1lIGh1bWFuaXRhaXJlIHBvdXIgYWlkZXIgbGVzIGFmZ2hhbnMgw6Agc+KAmWluc3RhbGxlciBhdSBDYW5hZGEuIjp7InBob25lIjoiMjhmZWMyODMtYjI1Yi00N2MxLTk5ZWUtZTQ4YzIwOGVmYTIzIiwiZW1haWwiOiJhYjI2YTZiNS01N2FhLTRjYzItODVmZS0zMDUzZWQzNDRmZTgifX0sIkZyZW5jaCI6eyJJbW1pZ3JhdGlvbiBwcm9ncmFtIGZvciBBZmdoYW5zIHdobyBhc3Npc3RlZCB0aGUgR292ZXJubWVudCBvZiBDYW5hZGEgYW5kIHRoZWlyIGVsaWdpYmxlIGZhbWlseSBtZW1iZXJzLiI6eyJwaG9uZSI6IjUzMzQyNGM2LTUxMzAtNDMzMS1hNGZhLTQyYjBjNjliNmUxMSIsImVtYWlsIjoiY2RmN2QzNzAtNzFjMi00OGFkLTlkNTktNGUyZjdiOWI4MjgifSwiSHVtYW5pdGFyaWFuIHByb2dyYW0gdG8gaGVscCBBZmdoYW4gbmF0aW9uYWxzIHJlc2V0dGxlIHRvIENhbmFkYS4iOnsicGhvbmUiOiI0NDkzYmU5MS00ZWUyLTQyY2MtODdkNi05ZTRlYjhhMDg1NTQiLCJlbWFpbCI6ImViYTc5ZWRhLTBjYjYtNGZmNi1iZTAzLWE2ZmRlMTU2NWQ5NiJ9fSwiRnJhbsOnYWlzIjp7IlByb2dyYW1tZSBk4oCZaW1taWdyYXRpb24gcG91ciBsZXMgQWZnaGFucyBxdWkgb250IGFpZMOpIGxlIGdvdXZlcm5lbWVudCBkdSBDYW5hZGEgZXQgbGVzIG1lbWJyZXMgYWRtaXNzaWJsZXMgZGUgbGV1cnMgZmFtaWxsZXMuIjp7InBob25lIjoiNTMzNDI0YzYtNTEzMC00MzMxLWE0ZmEtNDJiMGM2OWI2ZTExIiwiZW1haWwiOiJjZGY3ZDM3MC03MWMyLTQ4YWQtOWQ1OS00ZTJmN2I5YjgyOCJ9LCJQcm9ncmFtbWUgaHVtYW5pdGFpcmUgcG91ciBhaWRlciBsZXMgYWZnaGFucyDDoCBz4oCZaW5zdGFsbGVyIGF1IENhbmFkYS4iOnsicGhvbmUiOiI0NDkzYmU5MS00ZWUyLTQyY2MtODdkNi05ZTRlYjhhMDg1NTQiLCJlbWFpbCI6ImViYTc5ZWRhLTBjYjYtNGZmNi1iZTAzLWE2ZmRlMTU2NWQ5NiJ9fX19Cg=="
          + "list_manager_api_key"     = (known after apply)
          + "list_manager_host"        = "https://list-manager.alpha.canada.ca"
            # (16 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-viewer:230" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 230 -> (known after apply)
        tags                     = {
            "CostCentre" = "Forms"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "forms_secrets_manager" {
        id        = "arn:aws:iam::687401027353:policy/formsSecretsManagerKeyRetrieval"
        name      = "formsSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.load_testing will be updated in-place
  ~ resource "aws_lambda_function" "load_testing" {
        id                             = "LoadTesting"
      ~ last_modified                  = "2021-08-17T19:37:51.621+0000" -> (known after apply)
      ~ source_code_hash               = "i0Rauj4G/zd+MXXKwxGLgSczJheClVPR3cH/64qqE78=" -> "rf3NAx+8dyh+Rp8EIy7SO1fXk29QuRo1K0IU1F2nPbc="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.organisations will be updated in-place
  ~ resource "aws_lambda_function" "organisations" {
        id                             = "Organisations"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:7",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.retrieval will be updated in-place
  ~ resource "aws_lambda_function" "retrieval" {
        id                             = "Retrieval"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.templates will be updated in-place
  ~ resource "aws_lambda_function" "templates" {
        id                             = "Templates"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.organisations_lib must be replaced
-/+ resource "aws_lambda_layer_version" "organisations_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ created_date                = "2021-07-13T19:14:04.495+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QO1V+FhaIkZjr6Sl850U1vEKTXny0o1rGzhWUbBXbkw=" -> "48EJ84qpIym5jelu9uB98J+dCWlegI822XLuZb1ncP0=" # forces replacement
      ~ source_code_size            = 2483467 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8" -> (known after apply)
      ~ created_date                = "2021-06-30T21:04:00.285+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "O8thUBp7GpSWqrGqTOHFIOLIUD8VPW1x+7pv0uo5LdU=" -> "O1zUVLrt272O2lx+6wJ+Bk0Zrza4N0WWVfEX4UoWsAU=" # forces replacement
      ~ source_code_size            = 13661655 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.retrieval_lib must be replaced
-/+ resource "aws_lambda_layer_version" "retrieval_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-28T19:53:44.191+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RvSAqGag7CLOZltsLTfxoXP+3wBhARo6PjRibsXSP30=" -> "qcHId9Wnzl7ceyjE5U6ggZpbWencqEGKHx4OP0LSAx4=" # forces replacement
      ~ source_code_size            = 3316708 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.submission_lib must be replaced
-/+ resource "aws_lambda_layer_version" "submission_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ created_date                = "2021-04-29T12:58:47.849+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "51vLtKdfwIEdnPUHX/lC01ol1wk+LX9kaGerlVkbjgU=" -> "1ARs9b+tsfyvs0fVLZZD65WBYoowJENJqyCGclujT+w=" # forces replacement
      ~ source_code_size            = 3263905 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-29T16:11:14.218+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "l1lxGU/o2C15AooV3dMWSp7XVXB2tnX6151tAaMh0Fc=" -> "abA8dRapPg32CDFgXsq6VHV5IWNMypeQKz8lRY0qZHo=" # forces replacement
      ~ source_code_size            = 2403413 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.list_manager_api_key will be created
  + resource "aws_secretsmanager_secret" "list_manager_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "list_manager_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.list_manager_api_key will be created
  + resource "aws_secretsmanager_secret_version" "list_manager_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 8 to add, 7 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>